#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay: Refreshing state... [id=qmqngamsb0]
module.lambda.aws_lambda_function.tech_lanches_lambda: Refreshing state... [id=tech-lanches-lambda]
module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool: Refreshing state... [id=us-east-1_y9boC0aS4]
module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client: Refreshing state... [id=1vsbgthkpf0n1dnfr70ti3ge5c]
module.apiGateway.aws_api_gateway_resource.proxy: Refreshing state... [id=bcb5kh]
module.apiGateway.aws_lambda_permission.apigateway_lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apiGateway.aws_api_gateway_method.proxy: Refreshing state... [id=agm-qmqngamsb0-bcb5kh-ANY]
module.apiGateway.aws_api_gateway_integration.lambda: Refreshing state... [id=agi-qmqngamsb0-bcb5kh-ANY]
module.apiGateway.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=8fi5ob]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.apiGateway.aws_api_gateway_method.proxy has been deleted
  - resource "aws_api_gateway_method" "proxy" {
      - http_method          = "ANY" -> null
        id                   = "agm-qmqngamsb0-bcb5kh-ANY"
      - resource_id          = "bcb5kh" -> null
        # (6 unchanged attributes hidden)
    }

  # module.apiGateway.aws_api_gateway_resource.proxy has been deleted
  - resource "aws_api_gateway_resource" "proxy" {
      - id          = "bcb5kh" -> null
        # (4 unchanged attributes hidden)
    }

  # module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay has been deleted
  - resource "aws_api_gateway_rest_api" "tech_lanches_api_gateweay" {
      - execution_arn                = "arn:aws:execute-api:us-east-1:590184128247:qmqngamsb0" -> null
      - id                           = "qmqngamsb0" -> null
        name                         = "tech-lanches-api-gateway"
      - root_resource_id             = "1lu305asz8" -> null
        tags                         = {
            "Name" = "techlanches_apigateway"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool has been deleted
  - resource "aws_cognito_user_pool" "tech_lanches_clientes_pool" {
      - id                        = "us-east-1_y9boC0aS4" -> null
        name                      = "tech-lanches-clientes-pool"
        tags                      = {
            "Name" = "tech_lanches_clientes_pool"
        }
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda has been deleted
  - resource "aws_lambda_function" "tech_lanches_lambda" {
      - function_name                  = "tech-lanches-lambda" -> null
        id                             = "tech-lanches-lambda"
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:590184128247:function:tech-lanches-lambda/invocations" -> null
        tags                           = {
            "Name" = "tech-lanches-lambda"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.apiGateway.aws_api_gateway_deployment.gateway_deployment must be replaced
-/+ resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date  = "2024-03-01T22:25:45Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:590184128247:qmqngamsb0/Development" -> (known after apply)
      ~ id            = "8fi5ob" -> (known after apply)
      ~ invoke_url    = "https://qmqngamsb0.execute-api.us-east-1.amazonaws.com/Development" -> (known after apply)
      ~ rest_api_id   = "qmqngamsb0" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.apiGateway.aws_api_gateway_integration.lambda will be created
  + resource "aws_api_gateway_integration" "lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_resource.proxy will be created
  + resource "aws_api_gateway_resource" "proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.apiGateway.aws_api_gateway_rest_api.tech_lanches_api_gateweay will be created
  + resource "aws_api_gateway_rest_api" "tech_lanches_api_gateweay" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "tech-lanches-api-gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "Name" = "techlanches_apigateway"
        }
      + tags_all                     = {
          + "Name" = "techlanches_apigateway"
        }
    }

  # module.apiGateway.aws_lambda_permission.apigateway_lambda will be created
  + resource "aws_lambda_permission" "apigateway_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tech-lanches-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_cognito_user_pool.tech_lanches_clientes_pool will be created
  + resource "aws_cognito_user_pool" "tech_lanches_clientes_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "tech-lanches-clientes-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Name" = "tech_lanches_clientes_pool"
        }
      + tags_all                   = {
          + "Name" = "tech_lanches_clientes_pool"
        }

      + username_configuration {
          + case_sensitive = false
        }
    }

  # module.cognito.aws_cognito_user_pool_client.tech_lanches_clientes_pool_client will be created
  + resource "aws_cognito_user_pool_client" "tech_lanches_clientes_pool_client" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "pool-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.lambda.aws_lambda_function.tech_lanches_lambda will be created
  + resource "aws_lambda_function" "tech_lanches_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "Serverless/auth_lambda.zip"
      + function_name                  = "tech-lanches-lambda"
      + handler                        = "TechLanchesLambda::TechLanchesLambda.Functions_LambdaAuth_Generated::LambdaAuth"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::590184128247:role/LabRole"
      + runtime                        = "dotnet8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "tech-lanches-lambda"
        }
      + tags_all                       = {
          + "Name" = "tech-lanches-lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)
    }

Plan: 9 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @nsosoares, Action: `pull_request`*